% 두 일차함수 정의
% 첫 번째 일차함수: y = -x + 1344
% 두 번째 일차함수: y = (71/30)x + 1008

% x 값 범위 설정
x = 0:0.1:330;

% 일차함수 계산
y1 = -0.28*x + 101.13;
y2 = 1/2*x + 97.77;

% 그래프 그리기
figure; % 새로운 그림 창 열기
plot(x, y1, 'r', 'LineWidth', 2); % 첫 번째 일차함수, 빨간색, 선 두께 2
hold on; % 현재 그래프에 추가

plot(x, y2, 'b', 'LineWidth', 2); % 두 번째 일차함수, 파란색, 선 두께 2

% 그래프 제목과 축 라벨 추가
title('두 일차함수 그래프');
xlabel('x 값');
ylabel('y 값');


% 격자 추가
grid on;

% 축 범위 설정
xlim([0 330]);
ylim([1000 1800]);

xticks(0:30:330);





% 그래프 제목과 축 라벨 추가
title('Coverage Timeline (Satellite 12)');
xlabel('times');
ylabel('Coverage');


% 격자 추가
grid on;

% 축 범위 설정
xlim([0 12]);
ylim([97 102]);

% x축 눈금을 30 단위로 설정
xticks(0:1:12);

% 순서쌍을 점으로 표현
% x좌표와 y좌표의 값들을 입력하세요
x_points1 = [0 1 2 3 4 5 6 7 8 9 10 11 12]; % x 좌표 값들
y_points1 = [99.49 99.44 99.41 99.37 99.36 99.30 99.21 99.02 98.79 98.69 98.27 98.05 97.77]; % y 좌표 값들

x_points2 = [0 1 2 3 4 5 6 7 8 9 10 11 12]; % 두 번째 그룹 x 좌표 값들
y_points2 = [97.77 98.27 98.76 99.08 99.40 99.59 99.73 99.82 99.83 99.91 99.92 99.97 100]; % 두 번째 그룹 y 좌표 값들

% 순서쌍 점들을 그래프에 추가
scatter(x_points1, y_points1, 'filled', 'r'); % 첫 번째 그룹: 검은색으로 채워진 점들
scatter(x_points2, y_points2, 'filled', 'b'); % 두 번째 그룹: 초록색으로 채워진 점들

hold off;
